
## Plan Result (section-manager-lambda-cdk-production)

[CI link](https://github.com/Pocket/content-monorepo/actions/runs/20112901067)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.section-manager-sqs-lambda_D7365DAE


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.section-manager-sqs-lambda_D7365DAE will be updated in-place
  ~ resource "aws_lambda_function" "section-manager-sqs-lambda_D7365DAE" {
        id                             = "SectionManagerLambda-Prod-SQS-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:SectionManagerLambda-Prod-SQS-Function:60" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:SectionManagerLambda-Prod-SQS-Function:60/invocations" -> (known after apply)
        tags                           = {
            "app_code"       = "content"
            "component_code" = "content-sectionmanagerlambda"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "service"        = "SectionManagerLambda"
        }
      ~ version                        = "60" -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"     = "cef908325a2e456d275e25abec35aff373ee1a57" -> null
                # (5 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




## :warning: Errors

* failed to add a label section-manager-lambda-cdk-production/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":355,"Program":"tfcmt","SHA1":"3157b6c4b9261c3e1ba95c67c7041d1be6ce5b3f","Target":"section-manager-lambda-cdk-production","Vars":{},"WorkflowName":"Section Manager Lambda"} -->